In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1 = {
    "name":['harry','rohan','skillf','shubh'],
    "marks":[12, 34, 24, 67],
    "city":['Barrackpore','kolkata','bareilly','antertica']
}

In [3]:
pd.DataFrame(dict1)

     name  marks         city
0   harry     12  Barrackpore
1   rohan     34      kolkata
2  skillf     24     bareilly
3   shubh     67    antertica

In [4]:
df = pd.DataFrame(dict1)

In [5]:
df

     name  marks         city
0   harry     12  Barrackpore
1   rohan     34      kolkata
2  skillf     24     bareilly
3   shubh     67    antertica

In [6]:
df.to_csv('freinds.csv')

In [7]:
df.to_csv('freinds_index_false.csv',index=False)

In [8]:
df.head(2)

    name  marks         city
0  harry     12  Barrackpore
1  rohan     34      kolkata

In [9]:
df.tail(2)

     name  marks       city
2  skillf     24   bareilly
3   shubh     67  antertica

In [10]:
df.describe()

           marks
count   4.000000
mean   34.250000
std    23.613203
min    12.000000
25%    21.000000
50%    29.000000
75%    42.250000
max    67.000000